'''
    绘制直线、矩形、圆形、椭圆形、多边形、文字
'''

import cv2
import numpy as np

'''            直线            '''
img01 = np.zeros((200, 500, 3), np.uint8)  # # 全黑背景 长500 宽200 彩图
# 绘制直线 背景/   起始点/  终点/       颜色/       粗细度
cv2.line(img01, (0, 0), (500, 200), (0, 0, 255), 5)
cv2.line(img01, (500, 0), (0, 200), (255, 0, 255), 5)
cv2.imshow('img01', img01)
'''            矩形           '''
# 绘制矩形       背景/   起始点/        终点/       颜色/  粗细度
cv2.rectangle(img01, (50, 180), (400, 70), (255, 0, 0), 5)
cv2.imshow('img02', img01)
'''            圆形           '''
img03 = np.zeros((200, 500, 3), np.uint8)  # 全黑背景 长500 宽200 彩图
# 绘制圆形    背景/    圆心/     半径/  颜色/    粗细度（-1为实心）
cv2.circle(img03, (300, 100), 50, (0, 255, 0), 5)
cv2.circle(img03, (190, 100), 50, (255, 255, 0), -1)
cv2.imshow('img03', img03)
'''            椭圆形           '''
# 全黑背景 长500 宽200 彩图
img04 = np.zeros((200, 500, 3), np.uint8)
# 绘制圆形    背景/     椭圆圆心/  (长轴,短轴)/偏转角/起始角度/终结角度/颜色/粗细度（-1为实心）
cv2.ellipse(img04, (200, 100), (100, 50), 0, 0, 360, (255, 255, 0), 5)
cv2.ellipse(img04, (400, 100), (20, 60), -45, 0, 360, (0, 255, 255), -1)
# 显示图像
cv2.imshow('img04', img04)
'''            多边形           '''
# 全黑背景 长500 宽200 彩图
img05 = np.zeros((512, 512, 3), np.uint8)
pts = np.array([[50, 190], [380, 420], [255, 50], [120, 420], [450, 190]])
# 绘制五角星    背景/曲线阵列/ 闭合/       颜色/   粗细度
cv2.polylines(img05, [pts], True, (255, 0, 255), 10)
# 显示图像
cv2.imshow('img05', img05)
'''            文字           '''
# 全黑背景 长500 宽200 彩图
img06 = np.zeros((200, 500, 3), np.uint8)
# 绘制圆形    背景/     字样/                    位置 /字体                        /字体大小/颜色      /粗细度
cv2.putText(img06, 'I Love CV', (10, 100), cv2.FONT_HERSHEY_SIMPLEX, 0.6, (0, 255, 255), 2)
# 显示图像
cv2.imshow('img06', img06)

cv2.waitKey()
cv2.destroyAllWindows()
